List peoples = [
  hermione,
  harry,
  ron,
  dumbledore,
  malfoy,
  minerva,
  snape,
  hagrid
];

// Usrs

Map hermione = {
  'name': 'Гермиона',
  'img': 'assets/Гермиона.jpg',
  'online': '20:05',
  'quote':
      'Если у тебя эмоциональный диапазон, как у чайной ложки, это не значит, что у нас такой же.',
  'messages': hermione_chat,
  'id': null,
};

Map harry = {
  'name': 'Гарри',
  'online': '19:44',
  'img': 'assets/Гарри.jpg',
  'quote': 'Зачем искать того, кто хочет тебя убить?',
  'messages': harry_chat,
  'id': null,
};

Map ron = {
  'name': 'Волан-де-Морт',
  'online': '10:55',
  'img': 'assets/Рон.jpg',
  'quote':
      'Шляпа призывала быть храбрыми и сильными в это тяжелое время. Легко ей говорить, да? Она же шляпа!',
  'messages': ron_chat,
  'id': null,
};

Map dumbledore = {
  'name': 'Дамблдор',
  'online': '23:07',
  'img': 'assets/Дамблдор.jpg',
  'quote':
      'Удивительная вещь – время, могущественная, а когда в него вмешиваются – опасная',
  'messages': dumbledore_chat,
  'id': null,
};

Map malfoy = {
  'name': 'Малфой',
  'online': '00:11',
  'img': 'assets/Малфой.jpg',
  'quote':
      'Знаменитый Гарри Поттер, не успел зайти в лавку и тут же попал в газету',
  'messages': malfoy_chat,
  'id': null,
};

Map minerva = {
  'name': 'Минерва',
  'online': '20:39',
  'img': 'assets/Минерва.jpg',
  'quote': 'Возьмите Уизли с собой, а то уж больно он довольный',
  'messages': minerva_chat,
  'id': null,
};

Map snape = {
  'name': 'Снейп',
  'online': '16:10',
  'img': 'assets/Снейп.jpg',
  'quote': 'Не стоит упускать возможность насладиться хорошей погодой',
  'messages': snape_chat,
  'id': null,
};

Map hagrid = {
  'name': 'Хагрид',
  'online': '08:32',
  'img': 'assets/Хагрид.jpg',
  'quote':
      'Школьные факультеты. Их четыре всего. Про Пуффендуй говорят, что там самые тупицы учатся, но...',
  'messages': hagrid_chat,
  'id': null,
};

// Chats

// ignore: non_constant_identifier_names
List hermione_chat = [
  {'1': 'ПрИвЕтИк'},
  {'0': 'Что надо?'},
  {'1': 'Ты ЧеГо ТаКаЯ БукА? =)'},
  {'0': 'Тебя мозгошмыги покусали?!'},
  {'1': 'ЧеГоО?!?!?!'},
  {'0': 'ТеБЯ МОзГоШмыГи ПоКУсаЛи?!'},
];

// ignore: non_constant_identifier_names
List harry_chat = [
  {'0': 'ппц, сижу ржу дома, не могу успокоиться))'},
  {'1': 'чего там?'},
  {
    '0':
        'короче стою сегодня курю около метро, после универа.ко мне подходит поцан и спрашивает спички. а я как раз утром из Хогсварда коробок прихватил. ну я ни слова не говорю, вытаскиваю из кармана, протягиваю.'
  },
  {'0': 'он так смотрит, грит, зажигалкой то удобнее'},
  {'0': 'я опять же молча лезу в тот же карман и достаю крикет'},
  {
    '0':
        'он прикуривает, отдает зажигалку, смотрит на меня секунд десять и говорит типо в шутку какой карман удивительный, все что не попросишь, все есть, небось и конфеты есть'
  },
  {'1': 'тааак, я начинаю догадываться)'},
  {'0': '))))не поверишь, уже неделю ношу с собой несколько бон пари.'},
  {
    '0':
        'я молча достаю из того же кармана леденец, он ошарашенно берет его, его глаза полны ужаса'
  },
  {'1': 'ппц, бедняга))'},
  {
    '0':
        'после этого я говорю ему "ты потратил все три своих желания", выкидываю сигарету, разворачиваюсь и ухожу'
  },
];

// ignore: non_constant_identifier_names
List ron_chat = [
  {'0': 'Я завтра зайду в 10'},
  {'1': 'Бл*ть, Рон! Смени ник!'},
];

// ignore: non_constant_identifier_names
List dumbledore_chat = [
  {'1': 'Профессор можете объяснить, как делятся клетки?'},
  {'0': 'o'},
  {'0': '0'},
  {'0': '8'},
  {'0': 'oo'},
];

// ignore: non_constant_identifier_names
List malfoy_chat = [
  {'0': 'Передай Поттеру, что у него большие проблемы!!!'},
];

// ignore: non_constant_identifier_names
List snape_chat = [
  {'0': 'Передайте мистеру Поттеру, что у него большие проблемы!'},
];

// ignore: non_constant_identifier_names
List hagrid_chat = [
  {'0': 'Привет Где Гарри?'},
];

// ignore: non_constant_identifier_names
List minerva_chat = [
  {'0': 'Передайте мистеру Уизли, что у него большие проблемы!'},
];
